ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MCU_MCRC64_0_REGS.xml
<module name="MCU_MCRC64_0_REGS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MCRC64_REGS_CRC_CTRL0" acronym="MCRC64_REGS_CRC_CTRL0" offset="0x0" width="32" description="CRC Global Control Register 0">
		<bitfield id="CH4_PSA_SWRE" width="1" begin="24" end="24" resetval="0x0" description="Channel 4 PSA Software Reset. When set, the PSA Signature Register is reset to all zero. Software reset does not reset software reset bit itself. Therefore, CPU is required to clear this bit by writing a 0 . 0 = PSA Signature Register not reset 1 = PSA Signature Register reset" range="24" rwaccess="R/W"/> 
		<bitfield id="CH3_PSA_SWRE" width="1" begin="16" end="16" resetval="0x0" description="Channel 3 PSA Software Reset. When set, the PSA Signature Register is reset to all zero. Software reset does not reset software reset bit itself. Therefore, CPU is required to clear this bit by writing a 0 . 0 = PSA Signature Register not reset 1 = PSA Signature Register reset" range="16" rwaccess="R/W"/> 
		<bitfield id="CH2_PSA_SWRE" width="1" begin="8" end="8" resetval="0x0" description="Channel 2 PSA Software Reset. When set, the PSA Signature Register is reset to all zero. Software reset does not reset software reset bit itself. Therefore, CPU is required to clear this bit by writing a 0 . 0 = PSA Signature Register not reset 1 = PSA Signature Register reset" range="8" rwaccess="R/W"/> 
		<bitfield id="CH1_PSA_SWRE" width="1" begin="0" end="0" resetval="0x0" description="Channel 1 PSA Software Reset. When set, the PSA Signature Register is reset to all zero. Software reset does not reset software reset bit itself. Therefore, CPU is required to clear this bit by writing a 0 . 0 = PSA Signature Register not reset 1 = PSA Signature Register reset" range="0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_CTRL1" acronym="MCRC64_REGS_CRC_CTRL1" offset="0x8" width="32" description="CRC Global Control Register 1">
		<bitfield id="PWDN" width="1" begin="0" end="0" resetval="0x0" description="Power Down. When set, MCRC moduleMCRC Module is put in power down mode. 0 = MCRC is not in power down mode. 1 = MCRC is in power down mode." range="0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_CTRL2" acronym="MCRC64_REGS_CRC_CTRL2" offset="0x10" width="32" description="Data capture mode is especially useful when it is used in conjunction when data trace (CH1_TRACEEN) for channel 1. The seed value can be planted in PSA Signature Register during data capture mode by writing a seed value into PSA Signature Register. Data trace enable bit is then set to snoop and compress any read transaction on Data buses. When trace enable bit is set, CH1_MODE is automatically reset to data capture mode. To change mode from one to another in the middle of an on-going mode user should take the following steps:">
		<bitfield id="CH4_MODE" width="2" begin="25" end="24" resetval="0x0" description="Channel 4 Mode.  00 = Data Capture mode. In this mode, the PSA Signature Register does not compress data when it is written. Any data written to PSA Signature Register is simply captured by PSA Signature Register without any compression. This mode can be used to plant seed value into the PSA register.  01 = AUTO mode  10 = Semi-CPU mode 11 = Full-CPU mode For all four channels the seed value can be first planted into PSA register before the Channel Mode is switched to Full-CPU mode since host CPU controls the amount of data for compression. During AUTO mode, the PSA register is automatically reset to zero at the end of each sector compression." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="CH3_MODE" width="2" begin="17" end="16" resetval="0x0" description="Channel 3 Mode.  00 = Data Capture mode. In this mode, the PSA Signature Register does not compress data when it is written. Any data written to PSA Signature Register is simply captured by PSA Signature Register without any compression. This mode can be used to plant seed value into the PSA register.  01 = AUTO mode  10 = Semi-CPU mode 11 = Full-CPU mode" range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="CH2_MODE" width="2" begin="9" end="8" resetval="0x0" description="Channel 2 Mode.  00 = Data Capture mode. In this mode, the PSA Signature Register does not compress data when it is written. Any data written to PSA Signature Register is simply captured by PSA Signature Register without any compression. This mode can be used to plant seed value into the PSA register.  01 = AUTO mode  10 = Semi-CPU mode 11 = Full-CPU mode" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="CH1_TRACEEN" width="1" begin="4" end="4" resetval="0x0" description="Channel 1 Data Trace Enable When set, the channel is put into data trace mode. The channel snoops on the CPU VBUSM, ITCM, DTCM buses for any read transaction. Any read data on these buses is compressed by the PSA Signature Register. When suspend is on, the PSA Signature Register does not compress any read data on these buses. 0 = Data Trace disable 1 = Data Trace enable" range="4" rwaccess="R/W"/> 
		<bitfield id="CH1_MODE" width="2" begin="1" end="0" resetval="0x0" description="Channel 1 Mode.  00 = Data Capture mode. In this mode, the PSA Signature Register does not compress data when it is written. Any data written to PSA Signature Register is simply captured by PSA Signature Register without any compression. This mode can be used to plant seed value into the PSA register.  01 = AUTO mode  10 = Semi-CPU mode 11 = Full-CPU mode" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_INTS" acronym="MCRC64_REGS_CRC_INTS" offset="0x18" width="32" description="CRC Interrupt Enable Set Register">
		<bitfield id="CH4_TIME_OUT_ENS_" width="1" begin="28" end="28" resetval="0x0" description="Channel 4 Timeout Interrupt Enable Bit Writing a one to this bit enable the timeout interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Timeout Interrupt disable 1 = Timeout Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Timeout Interrupt enable" range="28" rwaccess="R/W1TS"/> 
		<bitfield id="CH4_UNDERENS" width="1" begin="27" end="27" resetval="0x0" description="Channel 4 Underrun Interrupt Enable Bit Writing a one to this bit enable the underrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Underrun Interrupt disable 1 = Underrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Underrun Interrupt enable" range="27" rwaccess="R/W1TS"/> 
		<bitfield id="CH4_OVERENS" width="1" begin="26" end="26" resetval="0x0" description="Channel 4 Overrun Interrupt Enable Bit Writing a one to this bit enable the overrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Overrun Interrupt disable 1 = Overrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Overrun Interrupt enable" range="26" rwaccess="R/W1TS"/> 
		<bitfield id="CH4_CRC_FAILENS" width="1" begin="25" end="25" resetval="0x0" description="Channel 4 CRC Fail Interrupt Enable Bit. Writing a one to this bit enable the CRC fail interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = CRC Fail Interrupt disable 1 = CRC Fail Interrupt enable User and privileged mode write: 0 = Has no effect 1 = CRC Fail Interrupt enable" range="25" rwaccess="R/W1TS"/> 
		<bitfield id="CH4_CCITENS" width="1" begin="24" end="24" resetval="0x0" description="Channel 4 Compression Complete Interrupt Enable Bit.  Writing a one to this bit enable the CRC fail interrupt. Writing  a zero has no effect. Reading from this bit gives the status  (interrupt enable/disable).  User and privileged mode read: 0 = Compression Complete Interrupt disable 1 = Compression Complete Interrupt enable  User and privileged mode write: 0 = Has no effect 1 = Compression Complete Interrupt enable" range="24" rwaccess="R/W1TS"/> 
		<bitfield id="CH3_TIME_OUT_ENS" width="1" begin="20" end="20" resetval="0x0" description="Channel 3 Timeout Interrupt Enable Bit Writing a one to this bit enable the timeout interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Timeout Interrupt disable 1 = Timeout Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Timeout Interrupt enable" range="20" rwaccess="R/W1TS"/> 
		<bitfield id="CH3_UNDERENS" width="1" begin="19" end="19" resetval="0x0" description="Channel 3 Underrun Interrupt Enable Bit Writing a one to this bit enable the underrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Underrun Interrupt disable 1 = Underrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Underrun Interrupt enable" range="19" rwaccess="R/W1TS"/> 
		<bitfield id="CH3_OVERENS" width="1" begin="18" end="18" resetval="0x0" description="Channel 3 Overrun Interrupt Enable Bit Writing a one to this bit enable the overrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Overrun Interrupt disable 1 = Overrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Overrun Interrupt enable" range="18" rwaccess="R/W1TS"/> 
		<bitfield id="CH3_CRC_FAILENS" width="1" begin="17" end="17" resetval="0x0" description="Channel 3 CRC Fail Interrupt Enable Bit. Writing a one to this bit enable the CRC fail interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = CRC Fail Interrupt disable 1 = CRC Fail Interrupt enable User and privileged mode write: 0 = Has no effect 1 = CRC Fail Interrupt enable" range="17" rwaccess="R/W1TS"/> 
		<bitfield id="CH3_CCITENS" width="1" begin="16" end="16" resetval="0x0" description="Channel 3 Compression Complete Interrupt Enable Bit.  Writing a one to this bit enable the CRC fail interrupt. Writing  a zero has no effect. Reading from this bit gives the status  (interrupt enable/disable).  User and privileged mode read: 0 = Compression Complete Interrupt disable 1 = Compression Complete Interrupt enable  User and privileged mode write: 0 = Has no effect 1 = Compression Complete Interrupt enable" range="16" rwaccess="R/W1TS"/> 
		<bitfield id="CH2_TIME_OUT_ENS_" width="1" begin="12" end="12" resetval="0x0" description="Channel 2 Timeout Interrupt Enable Bit Writing a one to this bit enable the timeout interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Timeout Interrupt disable 1 = Timeout Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Timeout Interrupt enable" range="12" rwaccess="R/W1TS"/> 
		<bitfield id="CH2_UNDERENS" width="1" begin="11" end="11" resetval="0x0" description="Channel 2 Underrun Interrupt Enable Bit Writing a one to this bit enable the underrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Underrun Interrupt disable 1 = Underrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Underrun Interrupt enable" range="11" rwaccess="R/W1TS"/> 
		<bitfield id="CH2_OVERENS" width="1" begin="10" end="10" resetval="0x0" description="Channel 2 Overrun Interrupt Enable Bit Writing a one to this bit enable the overrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Overrun Interrupt disable 1 = Overrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Overrun Interrupt enable" range="10" rwaccess="R/W1TS"/> 
		<bitfield id="CH2_CRC_FAILENS" width="1" begin="9" end="9" resetval="0x0" description="Channel 2 CRC Fail Interrupt Enable Bit. Writing a one to this bit enable the CRC fail interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = CRC Fail Interrupt disable 1 = CRC Fail Interrupt enable User and privileged mode write: 0 = Has no effect 1 = CRC Fail Interrupt enable" range="9" rwaccess="R/W1TS"/> 
		<bitfield id="CH2_CCITENS" width="1" begin="8" end="8" resetval="0x0" description="Channel 2 Compression Complete Interrupt Enable Bit.  Writing a one to this bit enable the CRC fail interrupt. Writing  a zero has no effect. Reading from this bit gives the status  (interrupt enable/disable).  User and privileged mode read: 0 = Compression Complete Interrupt disable 1 = Compression Complete Interrupt enable  User and privileged mode write: 0 = Has no effect 1 = Compression Complete Interrupt enable" range="8" rwaccess="R/W1TS"/> 
		<bitfield id="CH1_TIME_OUT_ENS_" width="1" begin="4" end="4" resetval="0x0" description="Channel 1 Timeout Interrupt Enable Bit Writing a one to this bit enable the timeout interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Timeout Interrupt disable 1 = Timeout Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Timeout Interrupt enable" range="4" rwaccess="R/W1TS"/> 
		<bitfield id="CH1_UNDERENS" width="1" begin="3" end="3" resetval="0x0" description="Channel 1 Underrun Interrupt Enable Bit Writing a one to this bit enable the underrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Underrun Interrupt disable 1 = Underrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Underrun Interrupt enable" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="CH1_OVERENS" width="1" begin="2" end="2" resetval="0x0" description="Channel 1 Overrun Interrupt Enable Bit Writing a one to this bit enable the overrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Overrun Interrupt disable 1 = Overrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Overrun Interrupt enable" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="CH1_CRC_FAILENS" width="1" begin="1" end="1" resetval="0x0" description="Channel 1 CRC Fail Interrupt Enable Bit. Writing a one to this bit enable the CRC fail interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = CRC Fail Interrupt disable 1 = CRC Fail Interrupt enable User and privileged mode write: 0 = Has no effect 1 = CRC Fail Interrupt enable" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="CH1_CCITENS" width="1" begin="0" end="0" resetval="0x0" description="Channel 1 Compression Complete Interrupt Enable Bit.  Writing a one to this bit enable the CRC fail interrupt. Writing  a zero has no effect. Reading from this bit gives the status  (interrupt enable/disable).  User and privileged mode read: 0 = Compression Complete Interrupt disable 1 = Compression Complete Interrupt enable  User and privileged mode write: 0 = Has no effect 1 = Compression Complete Interrupt enable" range="0" rwaccess="R/W1TS"/>
	</register>
