ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MCU_MCRC64_0_REGS.xml
	<register id="MCRC64_REGS_CRC_INTR" acronym="MCRC64_REGS_CRC_INTR" offset="0x20" width="32" description="CRC Interrupt Enable Reset Register">
		<bitfield id="CH4_TIME_OUT_ENR" width="1" begin="28" end="28" resetval="0x0" description="Channel 4 Timeout Interrupt Disable Bit Writing a one to this bit disable the timeout interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Timeout Interrupt disable 1 = Timeout Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Timeout Interrupt enable" range="28" rwaccess="R/W1TC"/> 
		<bitfield id="CH4_UNDERENR" width="1" begin="27" end="27" resetval="0x0" description="Channel 4 Underrun Interrupt Disable Bit Writing a one to this bit disable the underrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Underrun Interrupt disable 1 = Underrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Underrun Interrupt enable" range="27" rwaccess="R/W1TC"/> 
		<bitfield id="CH4_OVERENR" width="1" begin="26" end="26" resetval="0x0" description="Channel 4 Overrun Interrupt Disable Bit Writing a one to this bit disable the overrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Overrun Interrupt disable 1 = Overrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Overrun Interrupt enable" range="26" rwaccess="R/W1TC"/> 
		<bitfield id="CH4_CRC_FAILENR" width="1" begin="25" end="25" resetval="0x0" description="Channel 4 CRC Fail Interrupt Disable Bit. Writing a one to this bit disable the CRC fail interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = CRC Fail Interrupt disable 1 = CRC Fail Interrupt enable User and privileged mode write: 0 = Has no effect 1 = CRC Fail Interrupt enable" range="25" rwaccess="R/W1TC"/> 
		<bitfield id="CH4_CCITENR" width="1" begin="24" end="24" resetval="0x0" description="Channel 4 Compression Complete Interrupt Disable Bit Writing a one to this bit disable the CRC fail interrupt.  Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable)  User and privileged mode read:  0 = Compression Complete Interrupt disable 1 = Compression Complete Interrupt enable  User and privileged mode write:  0 = Has no effect 1 = Compression Complete Interrupt disable" range="24" rwaccess="R/W1TC"/> 
		<bitfield id="CH3_TIME_OUT_ENR_" width="1" begin="20" end="20" resetval="0x0" description="Channel 3 Timeout Interrupt Disable Bit Writing a one to this bit disable the timeout interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Timeout Interrupt disable 1 = Timeout Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Timeout Interrupt enable" range="20" rwaccess="R/W1TC"/> 
		<bitfield id="CH3_UNDERENR" width="1" begin="19" end="19" resetval="0x0" description="Channel 3 Underrun Interrupt Disable Bit Writing a one to this bit disable the underrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Underrun Interrupt disable 1 = Underrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Underrun Interrupt enable" range="19" rwaccess="R/W1TC"/> 
		<bitfield id="CH3_OVERENR" width="1" begin="18" end="18" resetval="0x0" description="Channel 3 Overrun Interrupt Disable Bit Writing a one to this bit disable the overrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Overrun Interrupt disable 1 = Overrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Overrun Interrupt enable" range="18" rwaccess="R/W1TC"/> 
		<bitfield id="CH3_CRC_FAILENR" width="1" begin="17" end="17" resetval="0x0" description="Channel 3 CRC Fail Interrupt Disable Bit. Writing a one to this bit disable the CRC fail interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = CRC Fail Interrupt disable 1 = CRC Fail Interrupt enable User and privileged mode write: 0 = Has no effect 1 = CRC Fail Interrupt enable" range="17" rwaccess="R/W1TC"/> 
		<bitfield id="CH3_CCITENR" width="1" begin="16" end="16" resetval="0x0" description="Channel 3 Compression Complete Interrupt Disable Bit Writing a one to this bit disable the CRC fail interrupt.  Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable)  User and privileged mode read:  0 = Compression Complete Interrupt disable 1 = Compression Complete Interrupt enable  User and privileged mode write:  0 = Has no effect 1 = Compression Complete Interrupt disable" range="16" rwaccess="R/W1TC"/> 
		<bitfield id="CH2_TIME_OUT_ENR_" width="1" begin="12" end="12" resetval="0x0" description="Channel 2 Timeout Interrupt Disable Bit Writing a one to this bit disable the timeout interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Timeout Interrupt disable 1 = Timeout Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Timeout Interrupt enable" range="12" rwaccess="R/W1TC"/> 
		<bitfield id="CH2_UNDERENR" width="1" begin="11" end="11" resetval="0x0" description="Channel 2 Underrun Interrupt Disable Bit Writing a one to this bit disable the underrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Underrun Interrupt disable 1 = Underrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Underrun Interrupt enable" range="11" rwaccess="R/W1TC"/> 
		<bitfield id="CH2_OVERENR" width="1" begin="10" end="10" resetval="0x0" description="Channel 2 Overrun Interrupt Disable Bit Writing a one to this bit disable the overrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Overrun Interrupt disable 1 = Overrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Overrun Interrupt enable" range="10" rwaccess="R/W1TC"/> 
		<bitfield id="CH2_CRC_FAILENR" width="1" begin="9" end="9" resetval="0x0" description="Channel 2 CRC Fail Interrupt Disable Bit. Writing a one to this bit disable the CRC fail interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = CRC Fail Interrupt disable 1 = CRC Fail Interrupt enable User and privileged mode write: 0 = Has no effect 1 = CRC Fail Interrupt enable" range="9" rwaccess="R/W1TC"/> 
		<bitfield id="CH2_CCITENR" width="1" begin="8" end="8" resetval="0x0" description="Channel 2 Compression Complete Interrupt Disable Bit Writing a one to this bit disable the CRC fail interrupt.  Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable)  User and privileged mode read:  0 = Compression Complete Interrupt disable 1 = Compression Complete Interrupt enable  User and privileged mode write:  0 = Has no effect 1 = Compression Complete Interrupt disable" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="CH1_TIME_OUT_ENR_" width="1" begin="4" end="4" resetval="0x0" description="Channel 1 Timeout Interrupt Disable Bit Writing a one to this bit disable the timeout interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Timeout Interrupt disable 1 = Timeout Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Timeout Interrupt enable" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="CH1_UNDERENR" width="1" begin="3" end="3" resetval="0x0" description="Channel 1 Underrun Interrupt Disable Bit Writing a one to this bit disable the underrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Underrun Interrupt disable 1 = Underrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Underrun Interrupt enable" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="CH1_OVERENR" width="1" begin="2" end="2" resetval="0x0" description="Channel 1 Overrun Interrupt Disable Bit Writing a one to this bit disable the overrun interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = Overrun Interrupt disable 1 = Overrun Interrupt enable User and privileged mode write: 0 = Has no effect 1 = Overrun Interrupt enable" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="CH1_CRC_FAILENR" width="1" begin="1" end="1" resetval="0x0" description="Channel 1 CRC Fail Interrupt Disable Bit. Writing a one to this bit disable the CRC fail interrupt. Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable). User and privileged mode read: 0 = CRC Fail Interrupt disable 1 = CRC Fail Interrupt enable User and privileged mode write: 0 = Has no effect 1 = CRC Fail Interrupt enable" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="CH1_CCITENR" width="1" begin="0" end="0" resetval="0x0" description="Channel 1 Compression Complete Interrupt Disable Bit Writing a one to this bit disable the CRC fail interrupt.  Writing a zero has no effect. Reading from this bit gives the status (interrupt enable/disable)  User and privileged mode read:  0 = Compression Complete Interrupt disable 1 = Compression Complete Interrupt enable  User and privileged mode write:  0 = Has no effect 1 = Compression Complete Interrupt disable" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="MCRC64_REGS_CRC_STATUS" acronym="MCRC64_REGS_CRC_STATUS" offset="0x28" width="32" description="CRC Interrupt Status Register">
		<bitfield id="CH4_TIME_OUT" width="1" begin="28" end="28" resetval="0x0" description="Channel 4 CRC Timeout Status Flag This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode. 0 = No timeout interrupt is active 1 = Timeout interrupt is active" range="28" rwaccess="R/W1TC"/> 
		<bitfield id="CH4_UNDER" width="1" begin="27" end="27" resetval="0x0" description="Channel 4 CRC Underrun Status Flag. This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode only 0 = No underrun interrupt is active 1 = Underrun interrupt is active" range="27" rwaccess="R/W1TC"/> 
		<bitfield id="CH4_OVER" width="1" begin="26" end="26" resetval="0x0" description="Channel 4 CRC Overrun Status Flag This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode 0 = No overrun interrupt is active 1 = Overrun interrupt is active" range="26" rwaccess="R/W1TC"/> 
		<bitfield id="CH4_CRC_FAIL" width="1" begin="25" end="25" resetval="0x0" description="Channel 4 CRC Compare Fail Status Flag. This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode only. 0 = No CRC compare fail interrupt is active 1 = CRC compare fail interrupt is active" range="25" rwaccess="R/W1TC"/> 
		<bitfield id="CH4_CCIT" width="1" begin="24" end="24" resetval="0x0" description="Channel 4 CRC Pattern Compression Complete Status  Flag. This bit is cleared by writing a 1 to it only. Writing 0  has no effect. This bit is only set in Semi-CPU mode.  0 = No CRC pattern compression complete interrupt is  active 1 = CRC pattern compression complete interrupt is active" range="24" rwaccess="R/W1TC"/> 
		<bitfield id="CH3_TIME_OUT" width="1" begin="20" end="20" resetval="0x0" description="Channel 3 CRC Timeout Status Flag This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode. 0 = No timeout interrupt is active 1 = Timeout interrupt is active" range="20" rwaccess="R/W1TC"/> 
		<bitfield id="CH3_UNDER" width="1" begin="19" end="19" resetval="0x0" description="Channel 3 CRC Underrun Status Flag. This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode only 0 = No underrun interrupt is active 1 = Underrun interrupt is active" range="19" rwaccess="R/W1TC"/> 
		<bitfield id="CH3_OVER" width="1" begin="18" end="18" resetval="0x0" description="Channel 3 CRC Overrun Status Flag This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode 0 = No overrun interrupt is active 1 = Overrun interrupt is active" range="18" rwaccess="R/W1TC"/> 
		<bitfield id="CH3_CRC_FAIL" width="1" begin="17" end="17" resetval="0x0" description="Channel 3 CRC Compare Fail Status Flag. This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode only. 0 = No CRC compare fail interrupt is active 1 = CRC compare fail interrupt is active" range="17" rwaccess="R/W1TC"/> 
		<bitfield id="CH3_CCIT" width="1" begin="16" end="16" resetval="0x0" description="Channel 3 CRC Pattern Compression Complete Status  Flag. This bit is cleared by writing a 1 to it only. Writing 0  has no effect. This bit is only set in Semi-CPU mode.  0 = No CRC pattern compression complete interrupt is  active 1 = CRC pattern compression complete interrupt is active" range="16" rwaccess="R/W1TC"/> 
		<bitfield id="CH2_TIME_OUT" width="1" begin="12" end="12" resetval="0x0" description="Channel 2 CRC Timeout Status Flag This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode. 0 = No timeout interrupt is active 1 = Timeout interrupt is active" range="12" rwaccess="R/W1TC"/> 
		<bitfield id="CH2_UNDER" width="1" begin="11" end="11" resetval="0x0" description="Channel 2 CRC Underrun Status Flag. This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode only 0 = No underrun interrupt is active 1 = Underrun interrupt is active" range="11" rwaccess="R/W1TC"/> 
		<bitfield id="CH2_OVER" width="1" begin="10" end="10" resetval="0x0" description="Channel 2 CRC Overrun Status Flag This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode 0 = No overrun interrupt is active 1 = Overrun interrupt is active" range="10" rwaccess="R/W1TC"/> 
		<bitfield id="CH2_CRC_FAIL" width="1" begin="9" end="9" resetval="0x0" description="Channel 2 CRC Compare Fail Status Flag. This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode only. 0 = No CRC compare fail interrupt is active 1 = CRC compare fail interrupt is active" range="9" rwaccess="R/W1TC"/> 
		<bitfield id="CH2_CCIT" width="1" begin="8" end="8" resetval="0x0" description="Channel 2 CRC Pattern Compression Complete Status  Flag. This bit is cleared by writing a 1 to it only. Writing 0  has no effect. This bit is only set in Semi-CPU mode.  0 = No CRC pattern compression complete interrupt is  active 1 = CRC pattern compression complete interrupt is active" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="CH1_TIME_OUT" width="1" begin="4" end="4" resetval="0x0" description="Channel 1 CRC Timeout Status Flag This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode. 0 = No timeout interrupt is active 1 = Timeout interrupt is active" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="CH1_UNDER" width="1" begin="3" end="3" resetval="0x0" description="Channel 1 CRC Underrun Status Flag. This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode only 0 = No underrun interrupt is active 1 = Underrun interrupt is active" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="CH1_OVER" width="1" begin="2" end="2" resetval="0x0" description="Channel 1 CRC Overrun Status Flag This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode 0 = No overrun interrupt is active 1 = Overrun interrupt is active" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="CH1_CRC_FAIL" width="1" begin="1" end="1" resetval="0x0" description="Channel 1 CRC Compare Fail Status Flag. This bit is cleared by writing a 1 to it only. Writing 0 has no effect. This bit is set in AUTO mode only. 0 = No CRC compare fail interrupt is active 1 = CRC compare fail interrupt is active" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="CH1_CCIT" width="1" begin="0" end="0" resetval="0x0" description="Channel 1 CRC Pattern Compression Complete Status  Flag. This bit is cleared by writing a 1 to it only. Writing 0  has no effect. This bit is only set in Semi-CPU mode.  0 = No CRC pattern compression complete interrupt is  active 1 = CRC pattern compression complete interrupt is active" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="MCRC64_REGS_CRC_INT_OFFSET_REG" acronym="MCRC64_REGS_CRC_INT_OFFSET_REG" offset="0x30" width="32" description="CRC Interrupt Offset">
		<bitfield id="CRC" width="8" begin="7" end="0" resetval="0x0" description="Interrupt Offset. This register indicates the highest priority pending interrupt vector address. Reading the offset register automatically clears the respective interrupt flag." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="MCRC64_REGS_CRC_BUSY" acronym="MCRC64_REGS_CRC_BUSY" offset="0x38" width="32" description="CRC Busy Register">
		<bitfield id="CH4_BUSY" width="1" begin="24" end="24" resetval="0x0" description="During AUTO or Semi-CPU mode, the busy flag is set when the first data pattern of the block is compressed and remains set until the the last data pattern of the block is compressed. The flag is cleared when the last data pattern of the block is compressed." range="24" rwaccess="R"/> 
		<bitfield id="CH3_BUSY" width="1" begin="16" end="16" resetval="0x0" description="During AUTO or Semi-CPU mode, the busy flag is set when the first data pattern of the block is compressed and remains set until the the last data pattern of the block is compressed. The flag is cleared when the last data pattern of the block is compressed." range="16" rwaccess="R"/> 
		<bitfield id="CH2_BUSY" width="1" begin="8" end="8" resetval="0x0" description="During AUTO or Semi-CPU mode, the busy flag is set when the first data pattern of the block is compressed and remains set until the the last data pattern of the block is compressed. The flag is cleared when the last data pattern of the block is compressed." range="8" rwaccess="R"/> 
		<bitfield id="CH1_BUSY" width="1" begin="0" end="0" resetval="0x0" description="During AUTO or Semi-CPU mode, the busy flag is set when the first data pattern of the block is compressed and remains set until the the last data pattern of the block is compressed. The flag is cleared when the last data pattern of the block is compressed." range="0" rwaccess="R"/>
	</register>
	<register id="MCRC64_REGS_CRC_PCOUNT_REG1" acronym="MCRC64_REGS_CRC_PCOUNT_REG1" offset="0x40" width="32" description="CRC Pattern Counter Preload Register1">
		<bitfield id="CRC_PAT_COUNT1" width="20" begin="19" end="0" resetval="0x0" description="Channel 1 Pattern Counter Preload Register. This register contains the number of data patterns in one sector to be compressed before a CRC is performed." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_SCOUNT_REG1" acronym="MCRC64_REGS_CRC_SCOUNT_REG1" offset="0x44" width="32" description="CRC Sector Counter Preload Register1">
		<bitfield id="CRC_SEC_COUNT1" width="16" begin="15" end="0" resetval="0x0" description="Channel 1 Sector Counter Preload Register. This register contains the number of sectors in one block of memory." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_CURSEC_REG1" acronym="MCRC64_REGS_CRC_CURSEC_REG1" offset="0x48" width="32" description="CRC Current Sector Register 1">
		<bitfield id="CRC_CURSEC1" width="16" begin="15" end="0" resetval="0x0" description="Channel 1 Current Sector ID Register. In AUTO mode, this register contains the current sector number of which the signature verification fails. The sector counter is a free running up counter. When a sector fails, the erroneous sector number is logged into current sector ID register and the CRC fail interrupt is generated The sector ID register is frozen until it is read and the CRC fail status bit is cleared by CPU. While it is frozen, it does not capture another erroneous sector number. When this condition happens, an overrun interrupt is generated instead. Once the register is read and the CRC fail interrupt flag is cleared it can capture new erroneous sector number." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="MCRC64_REGS_CRC_WDTOPLD1" acronym="MCRC64_REGS_CRC_WDTOPLD1" offset="0x4C" width="32" description="CRC channel 1 Watchdog Timeout Preload Register A">
		<bitfield id="CRC_WDTOPLD1" width="24" begin="23" end="0" resetval="0x0" description="Channel 1 Watchdog Timeout Counter Preload Register. This register contains the number of clock cycles within which the DMA must transfer the next block of data patterns." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_BCTOPLD1" acronym="MCRC64_REGS_CRC_BCTOPLD1" offset="0x50" width="32" description="CRC channel 1 Block Complete Timeout Preload Register B">
		<bitfield id="CRC_BCTOPLD1" width="24" begin="23" end="0" resetval="0x0" description="Channel 1 Block Complete Timeout Counter Preload Register. This register contains the number of clock cycles within which the CRC for an entire block needs to complete before a timeout interrupt is generated." range="23 - 0" rwaccess="R/W"/>
	</register>
