ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MCU_MCRC64_0_REGS.xml
	<register id="MCRC64_REGS_PSA_SIGREGL1" acronym="MCRC64_REGS_PSA_SIGREGL1" offset="0x60" width="32" description="Channel 1 PSA signature low register">
		<bitfield id="PSASIG1" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 PSA Signature Low Register. This register contains the value stored at PSASIG1[31:0] register." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_PSA_SIGREGH1" acronym="MCRC64_REGS_PSA_SIGREGH1" offset="0x64" width="32" description="Channel 1 PSA signature high register">
		<bitfield id="PSASIG1_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 PSA Signature High Register. This register contains the value stored at PSASIG1[63:32] register." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_REGL1" acronym="MCRC64_REGS_CRC_REGL1" offset="0x68" width="32" description="Channel 1 CRC value low register">
		<bitfield id="CRC1" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 CRC Value Low Register. This register contains the current known good signature value stored at CRC1[31:0] register." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_REGH1" acronym="MCRC64_REGS_CRC_REGH1" offset="0x6C" width="32" description="Channel 1 CRC value high register">
		<bitfield id="CRC1_47_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 CRC Value High Register. This register contains the current known good signature value stored at CRC1[63:32] register." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_PSA_SECSIGREGL1" acronym="MCRC64_REGS_PSA_SECSIGREGL1" offset="0x70" width="32" description="Channel 1 PSA sector signature low register">
		<bitfield id="PSASECSIG1" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 PSA Sector Signature Low Register. This register contains the value stored at PSASECSIG1[31:0] register." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="MCRC64_REGS_PSA_SECSIGREGH1" acronym="MCRC64_REGS_PSA_SECSIGREGH1" offset="0x74" width="32" description="Channel 1 PSA sector signature high register">
		<bitfield id="PSASECSIG1_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 PSA Sector Signature High Register. This register contains the value stored at PSASECSIG1[63:32] register." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="MCRC64_REGS_RAW_DATAREGL1" acronym="MCRC64_REGS_RAW_DATAREGL1" offset="0x78" width="32" description="Channel 1 Raw Data Low Register">
		<bitfield id="RAW_DATA1" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 Raw Data Low Register. This register contains bit 31:0 of the uncompressed raw data." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="MCRC64_REGS_RAW_DATAREGH1" acronym="MCRC64_REGS_RAW_DATAREGH1" offset="0x7C" width="32" description="Channel 1 Raw Data High Register">
		<bitfield id="RAW_DATA1_47_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 Raw Data High Register. This register contains bit 63:32 of the uncompressed raw data." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="MCRC64_REGS_CRC_PCOUNT_REG2" acronym="MCRC64_REGS_CRC_PCOUNT_REG2" offset="0x80" width="32" description="CRC Pattern Counter Preload Register2">
		<bitfield id="CRC_PAT_COUNT2" width="20" begin="19" end="0" resetval="0x0" description="CRC Pattern Counter Preload Register 2 This register contains the number of data patterns in one sector to be compressed before a CRC is performed." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_SCOUNT_REG2" acronym="MCRC64_REGS_CRC_SCOUNT_REG2" offset="0x84" width="32" description="CRC Sector Counter Preload Register2">
		<bitfield id="CRC_SEC_COUNT2" width="16" begin="15" end="0" resetval="0x0" description="Channel 2 Sector Counter Preload Register. This register contains the number of sectors in one block of memory." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_CURSEC_REG2" acronym="MCRC64_REGS_CRC_CURSEC_REG2" offset="0x88" width="32" description="CRC Current Sector Register 2">
		<bitfield id="CRC_CURSEC2" width="16" begin="15" end="0" resetval="0x0" description="Channel 2 Current Sector ID Register. In AUTO mode, this register contains the current sector number of which the signature verification fails. The sector counter is a free running up counter. When a sector fails, the erroneous sector number is logged into current sector ID register and the CRC fail interrupt is generated The sector ID register is frozen until it is read and the CRC fail status bit is cleared by CPU. While it is frozen, it does not capture another erroneous sector number. When this condition happens, an overrun interrupt is generated instead. Once the register is read and the CRC fail interrupt flag is cleared it can capture new erroneous sector number." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="MCRC64_REGS_CRC_WDTOPLD2" acronym="MCRC64_REGS_CRC_WDTOPLD2" offset="0x8C" width="32" description="CRC channel 2 Watchdog Timeout Preload Register">
		<bitfield id="CRC_WDTOPLD2" width="24" begin="23" end="0" resetval="0x0" description="Channel 2 Watchdog Timeout Counter Preload Register. This register contains the number of clock cycles within which the DMA must transfer the next block of data patterns." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_BCTOPLD2" acronym="MCRC64_REGS_CRC_BCTOPLD2" offset="0x90" width="32" description="CRC channel 2 Block Complete Timeout Preload Register">
		<bitfield id="CRC_BCTOPLD2" width="24" begin="23" end="0" resetval="0x0" description="Channel 2 Block Complete Timeout Counter Preload Register. This register contains the number of clock cycles within which the CRC of an entire block needs to complete before a timeout interrupt is generated." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_PSA_SIGREGL2" acronym="MCRC64_REGS_PSA_SIGREGL2" offset="0xA0" width="32" description="Channel 2 PSA signature low register">
		<bitfield id="PSASIG2" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 PSA Signature Low Register. This register contains the value stored at PSASIG2[31:0] register." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_PSA_SIGREGH2" acronym="MCRC64_REGS_PSA_SIGREGH2" offset="0xA4" width="32" description="Channel 2 PSA signature high register">
		<bitfield id="PSASIG2_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 PSA Signature High Register. This register contains the value stored at PSASIG2[63:32] register." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_REGL2" acronym="MCRC64_REGS_CRC_REGL2" offset="0xA8" width="32" description="Channel 2 CRC value low register">
		<bitfield id="CRC2" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 CRC Value Low Register. This register contains the current known good signature value stored at CRC2[31:0] register." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_REGH2" acronym="MCRC64_REGS_CRC_REGH2" offset="0xAC" width="32" description="Channel 2 CRC value high register">
		<bitfield id="CRC2_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 CRC Value High Register. This register contains the current known good signature value stored at CRC2[63:32] register." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_PSA_SECSIGREGL2" acronym="MCRC64_REGS_PSA_SECSIGREGL2" offset="0xB0" width="32" description="Channel 2 PSA sector signature low register">
		<bitfield id="PSASECSIG2" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 PSA Sector Signature Low Register. This register contains the value stored at PSASECSIG2[31:0] register." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="MCRC64_REGS_PSA_SECSIGREGH2" acronym="MCRC64_REGS_PSA_SECSIGREGH2" offset="0xB4" width="32" description="Channel 2 PSA sector signature high register">
		<bitfield id="PSASECSIG2_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 PSA Sector Signature High Register. This register contains the value stored at PSASECSIG2[63:32] register." range="31 - 0" rwaccess="R"/>
	</register>
