ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MCU_MCRC64_0_REGS.xml
	<register id="MCRC64_REGS_CRC_PCOUNT_REG4" acronym="MCRC64_REGS_CRC_PCOUNT_REG4" offset="0x100" width="32" description="CRC Pattern Counter Preload Register4">
		<bitfield id="CRC_PAT_COUNT4" width="20" begin="19" end="0" resetval="0x0" description="Channel 4 Pattern Counter Preload Register. This register contains the number of data patterns in one sector to be compressed before a CRC is performed." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_SCOUNT_REG4" acronym="MCRC64_REGS_CRC_SCOUNT_REG4" offset="0x104" width="32" description="CRC Sector Counter Preload Register4">
		<bitfield id="CRC_SEC_COUNT4" width="16" begin="15" end="0" resetval="0x0" description="Channel 4 Sector Counter Preload Register. This register contains the number of sectors in one block of memory." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_CURSEC_REG4" acronym="MCRC64_REGS_CRC_CURSEC_REG4" offset="0x108" width="32" description="CRC Current Sector Register 4">
		<bitfield id="CRC_CURSEC4" width="16" begin="15" end="0" resetval="0x0" description="In AUTO mode, this register contains the current sector number of which the signature verification fails. The sector counter is a free running up counter. When a sector fails, the erroneous sector number is logged into current sector ID register and the CRC fail interrupt is generated The sector ID register is frozen until it is read and the CRC fail status bit is cleared by CPU. While it is frozen, it does not capture another erroneous sector number. When this condition happens, an overrun interrupt is generated instead. Once the register is read and the CRC fail interrupt flag is cleared it can capture new erroneous sector number. In Semi-CPU mode, this register is used to indicate the sector number for which the compression complete has last happened." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="MCRC64_REGS_CRC_WDTOPLD4" acronym="MCRC64_REGS_CRC_WDTOPLD4" offset="0x10C" width="32" description="CRC channel 4 Watchdog Timeout Preload Register">
		<bitfield id="CRC_WDTOPLD4" width="24" begin="23" end="0" resetval="0x0" description="This register contains the number of clock cycles within which the DMA must transfer the next block of data patterns." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_BCTOPLD4" acronym="MCRC64_REGS_CRC_BCTOPLD4" offset="0x110" width="32" description="CRC channel 4 Block Complete Timeout Preload Register">
		<bitfield id="CRC_BCTOPLD4" width="24" begin="23" end="0" resetval="0x0" description="This register contains the number of clock cycles within which the CRC of an entire block needs to complete before a timeout interrupt is generated." range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_PSA_SIGREGL4" acronym="MCRC64_REGS_PSA_SIGREGL4" offset="0x120" width="32" description="Channel 4 PSA signature low register">
		<bitfield id="PSASIG4" width="32" begin="31" end="0" resetval="0x0" description="This register contains the value stored at PSASIG4[31:0] register." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_PSA_SIGREGH4" acronym="MCRC64_REGS_PSA_SIGREGH4" offset="0x124" width="32" description="Channel 4 PSA signature high register">
		<bitfield id="PSASIG4_63_32" width="32" begin="31" end="0" resetval="0x0" description="This register contains the value stored at PSASIG4[63:32] register." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_REGL4" acronym="MCRC64_REGS_CRC_REGL4" offset="0x128" width="32" description="Channel 4 CRC value low register">
		<bitfield id="CRC4" width="32" begin="31" end="0" resetval="0x0" description="Channel 4 CRC Value Low Register." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_CRC_REGH4" acronym="MCRC64_REGS_CRC_REGH4" offset="0x12C" width="32" description="Channel 4 CRC value high register">
		<bitfield id="CRC4_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 4 CRC Value High Register." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_PSA_SECSIGREGL4" acronym="MCRC64_REGS_PSA_SECSIGREGL4" offset="0x130" width="32" description="Channel 4 PSA sector signature low register">
		<bitfield id="PSASECSIG4" width="32" begin="31" end="0" resetval="0x0" description="Channel 4 PSA Sector Signature Low Register." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="MCRC64_REGS_PSA_SECSIGREGH4" acronym="MCRC64_REGS_PSA_SECSIGREGH4" offset="0x134" width="32" description="Channel 4 PSA sector signature high register">
		<bitfield id="PSASECSIG4_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 4 PSA Sector Signature High Register. This register contains the value stored at PSASECSIG4[63:32] register." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="MCRC64_REGS_RAW_DATAREGL4" acronym="MCRC64_REGS_RAW_DATAREGL4" offset="0x138" width="32" description="Channel 4 Raw Data Low Register">
		<bitfield id="RAW_DATA4" width="32" begin="31" end="0" resetval="0x0" description="Channel 4 Raw Data Low Register. This register contains bit 31:0 of the uncompressed raw data." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="MCRC64_REGS_RAW_DATAREGH4" acronym="MCRC64_REGS_RAW_DATAREGH4" offset="0x13C" width="32" description="Channel 4 Raw Data High Register">
		<bitfield id="RAW_DATA4_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 4 Raw Data High Register. This register contains bit 63:32 of the uncompressed raw data." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="MCRC64_REGS_MCRC_BUS_SEL" acronym="MCRC64_REGS_MCRC_BUS_SEL" offset="0x140" width="32" description="Data bus tracing selection">
		<bitfield id="MEN" width="1" begin="2" end="2" resetval="0x1" description="Enable/disables the tracing of VBUSM 0: Tracing of VBUSM master bus has been disabled 1: Tracing of VBUSM master bus has been enabled" range="2" rwaccess="R/W"/> 
		<bitfield id="DTC_MEN" width="1" begin="1" end="1" resetval="0x1" description="Enable/disables the tracing of data TCM 0: Tracing of DTCM_ODD and DTCM_EVEN buses have been disabled 1: Tracing of DTCM_ODD and DTCM_EVEN buses have been enabled" range="1" rwaccess="R/W"/> 
		<bitfield id="ITC_MEN" width="1" begin="0" end="0" resetval="0x1" description="Enable/disables the tracing of instruction TCM 0: Tracing of ITCM bus has been disabled 1: Tracing of ITCM bus has been enabled Please refer the description of CPU Data trace at page 1-21 for the priority between different data buses." range="0" rwaccess="R/W"/>
	</register>
	<register id="MCRC64_REGS_I0_PSA_SIGREG1_CPY" acronym="MCRC64_REGS_I0_PSA_SIGREG1_CPY" offset="0x200" width="32" description="Region for Channel 1 PSA signature block used by DMA based systems.">
		<bitfield id="I0_PSASIG1_CPY0" width="32" begin="31" end="0" resetval="0x0" description="This register is a 128 byte block copy of the PSASIG1 register for DMA destination, it is write only, the result can be found in the PSASIG1 register." range="31 - 0" rwaccess="W"/>
	</register>
	<register id="MCRC64_REGS_I0_PSA_SIGREG2_CPY" acronym="MCRC64_REGS_I0_PSA_SIGREG2_CPY" offset="0x280" width="32" description="Region for Channel 2 PSA signature block used by DMA based systems.">
		<bitfield id="I0_PSASIG2_CPY0" width="32" begin="31" end="0" resetval="0x0" description="This register is a 128 byte block copy of the PSASIG2 register for DMA destination, it is write only, the result can be found in the PSASIG2 register." range="31 - 0" rwaccess="W"/>
	</register>
	<register id="MCRC64_REGS_I0_PSA_SIGREG3_CPY" acronym="MCRC64_REGS_I0_PSA_SIGREG3_CPY" offset="0x300" width="32" description="Region for Channel 3 PSA signature block used by DMA based systems.">
		<bitfield id="I0_PSASIG3_CPY0" width="32" begin="31" end="0" resetval="0x0" description="This register is a 128 byte block copy of the PSASIG3 register for DMA destination, it is write only, the result can be found in the PSASIG3 register." range="31 - 0" rwaccess="W"/>
	</register>
	<register id="MCRC64_REGS_I0_PSA_SIGREG4_CPY" acronym="MCRC64_REGS_I0_PSA_SIGREG4_CPY" offset="0x380" width="32" description="Region for Channel 4 PSA signature block used by DMA based systems.">
		<bitfield id="I0_PSASIG4_CPY0" width="32" begin="31" end="0" resetval="0x0" description="This register is a 128 byte block copy of the PSASIG4 register for DMA destination, it is write only, the result can be found in the PSASIG4 register." range="31 - 0" rwaccess="W"/>
	</register>
</module>